using System;
using static System.Math;

namespace Fluid.Internals.Numerics {
   public static class SerendipityBasis {
      public static Func<double,double,double>[][] F { get; } = new Func<double,double,double>[][] {
         new Func<double,double,double>[] {                             // Basis functions.
            (ξ,η) => ((-1 + η)*(1 - ξ)*(-2 + η + η*η + ξ + ξ*ξ))/8.0,
            (ξ,η) => -((-1 + η)*Pow(-1 + ξ,2)*(1 + ξ))/8.0,
            (ξ,η) => ((-1 + η)*(-1 + ξ)*Pow(1 + ξ,2))/8.0,
            (ξ,η) => ((-1 + η)*(1 + ξ)*(-2 + η + η*η - ξ + ξ*ξ))/8.0,
            (ξ,η) => (Pow(-1 + η,2)*(1 + η)*(1 + ξ))/8.0,
            (ξ,η) => ((-1 + η)*Pow(1 + η,2)*(-1 - ξ))/8.0,
            (ξ,η) => ((1 + η)*(-1 - ξ)*(-2 - η + η*η - ξ + ξ*ξ))/8.0,
            (ξ,η) => ((1 + η)*(1 - ξ)*Pow(1 + ξ,2))/8.0,
            (ξ,η) => ((1 + η)*Pow(-1 + ξ,2)*(1 + ξ))/8.0,
            (ξ,η) => ((1 + η)*(-1 + ξ)*(-2 - η + η*η + ξ + ξ*ξ))/8.0,
            (ξ,η) => ((-1 + η)*Pow(1 + η,2)*(-1 + ξ))/8.0,
            (ξ,η) => (Pow(-1 + η,2)*(1 + η)*(1 - ξ))/8.0
         },
         new Func<double,double,double>[] {                             // Partials over ξ.
            (ξ,η) => -((-1 + η)*(-3 + η + η*η + 3*ξ*ξ))/8.0,
            (ξ,η) => -((-1 + η)*(-1 - 2*ξ + 3*ξ*ξ))/8.0,
            (ξ,η) => ((-1 + η)*(1 + ξ)*(-1 + 3*ξ))/8.0,
            (ξ,η) => ((-1 + η)*(-3 + η + η*η + 3*ξ*ξ))/8.0,
            (ξ,η) => (Pow(-1 + η,2)*(1 + η))/8.0,
            (ξ,η) => -((-1 + η)*Pow(1 + η,2))/8.0,
            (ξ,η) => -((1 + η)*(-3 - η + η*η + 3*ξ*ξ))/8.0,
            (ξ,η) => -((1 + η)*(-1 + 2*ξ + 3*ξ*ξ))/8.0,
            (ξ,η) => ((1 + η)*(-1 + ξ)*(1 + 3*ξ))/8.0,
            (ξ,η) => ((1 + η)*(-3 - η + η*η + 3*ξ*ξ))/8.0,
            (ξ,η) => ((-1 + η)*Pow(1 + η,2))/8.0,
            (ξ,η) => -(Pow(-1 + η,2)*(1 + η))/8.0
         },
         new Func<double,double,double>[] {                             // Partials over η.
            (ξ,η) => -((-1 + ξ)*(-3 + 3*η*η + ξ + ξ*ξ))/8.0,
            (ξ,η) => -(Pow(-1 + ξ,2)*(1 + ξ))/8.0,
            (ξ,η) => ((-1 + ξ)*Pow(1 + ξ,2))/8.0,
            (ξ,η) => ((1 + ξ)*(-3 + 3*η*η - ξ + ξ*ξ))/8.0,
            (ξ,η) => ((-1 + η)*(1 + 3*η)*(1 + ξ))/8.0,
            (ξ,η) => -((-1 + 2*η + 3*η*η)*(1 + ξ))/8.0,
            (ξ,η) => -((1 + ξ)*(-3 + 3*η*η - ξ + ξ*ξ))/8.0,
            (ξ,η) => -((-1 + ξ)*Pow(1 + ξ,2))/8.0,
            (ξ,η) => (Pow(-1 + ξ,2)*(1 + ξ))/8.0,
            (ξ,η) => ((-1 + ξ)*(-3 + 3*η*η + ξ + ξ*ξ))/8.0,
            (ξ,η) => ((1 + η)*(-1 + 3*η)*(-1 + ξ))/8.0,
            (ξ,η) => -((-1 - 2*η + 3*η*η)*(-1 + ξ))/8.0,
         }
      }
   }
}